src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/DataProcessors/СК_МобСклад/Forms/НоменклатураПоШК/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКНоменклатуры;
КонецПроцедуры

&НаСервере
Процедура ШКИзменениеТекстаРедактированияНаСервере(ШК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	Рез = Запрос.Выполнить().Выгрузить();

	Если Рез.Количество()=1 Тогда
		Инф = Строка(Рез[0].Номенклатура)+ Символы.ПС;
		
		ЗапросОбщ = Новый Запрос;
		ЗапросОбщ.Текст = "ВЫБРАТЬ
		                  |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
		                  |ИЗ
		                  |	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		                  |ГДЕ
		                  |	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура"; 
		ЗапросОбщ.УстановитьПараметр("Номенклатура",Рез[0].Номенклатура);
		РезОбщ = ЗапросОбщ.Выполнить().Выгрузить();
		
		Если РезОбщ.Количество()>=1 Тогда
			Инф = Инф + "Общий остаток:" + Строка(РезОбщ[0].ВНаличииОстаток)+" "+Рез[0].Номенклатура.ЕдиницаИзмерения + Символы.ПС;		
		КонецЕсли; 
		
		ЗапросЯчейки = Новый Запрос;
		ЗапросЯчейки.Текст = "ВЫБРАТЬ
		                     |	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
		                     |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
		                     |ИЗ
		                     |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
		                     |ГДЕ
		                     |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура";
		ЗапросЯчейки.УстановитьПараметр("Номенклатура",Рез[0].Номенклатура);
		РезЯч = ЗапросЯчейки.Выполнить().Выгрузить();
		
		Если РезЯч.Количество()>=1 Тогда 
			Инф = Инф + "Остатки по ячейкам:"+ Символы.ПС;
			Для Каждого стр из РезЯч  Цикл
				Инф = Инф + Строка(стр.Ячейка)+" -  "+Строка(стр.ВналичииОстаток)+" "+Рез[0].Номенклатура.ЕдиницаИзмерения+ Символы.ПС;
	
			КонецЦикла;
		КонецЕсли;	
		
		
		ЭтаФорма.Элементы.Информация.Заголовок = Инф;
		ЭтаФорма.Элементы.Ошибка.Заголовок = "";
	Иначе 
		ЭтаФорма.Элементы.Ошибка.Заголовок = "Номенклатура не найдена";
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКИзменениеТекстаРедактированияНаСервере(Текст);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ШКНоменклатуры.РедактированиеТекста = Истина;
	АктивироватьПоиск();

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.ШКНоменклатуры.ОбновитьТекстРедактирования();
	Элементы.ШКНоменклатуры.Видимость = Ложь;
	Элементы.ШКНоменклатуры.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКНоменклатуры; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШКНоменклатуры = "";
КонецПроцедуры
